Repository: libis/UB-digitalisering-omeka
Catalog: themes/default/languages/*.po
Languages: nl_be

source: Collection holders & partners
nl_be: Collectiehouders & partners

source: About the website
nl_be: Over de website

source: KU Leuven Libraries
nl_be: KU Leuven Bibliotheken

source: Website by
nl_be: Website door

source: Search...
nl_be: Zoek...

source: Search tips
nl_be: Zoektips

source: Browse through EXPO and discover collection items on display. To view all items, leave the search box empty and click 'search'.
nl_be: Grasduin in de hier tentoongestelde werken. Om alle werken te zien, kun je het zoekveld leeg laten en meteen op ‘zoeken’ klikken.

source: All
nl_be: Alles

source: read more
nl_be: lees meer

source: By:
nl_be: Door:

source: Is part of
nl_be: Maakt deel uit van

source: EXPO collection
nl_be: EXPO collectie

source: Search the website
nl_be: Zoek in de website

source: search
nl_be: zoeken

source: Virtual exhibitions
nl_be: Virtuele tentoonstellingen

source: Collection curators draw inspiration from KU Leuven Libraries' rich collections and guide you through their histories. Discover our online exhibitions.
nl_be: Curatoren putten uit de rijke collecties van KU Leuven Bibliotheken en nemen je mee in hun geschiedenis. Ontdek onze online exposities.

source: Visit the exhibitions
nl_be: Bezoek de tentoonstellingen

source: Gallery
nl_be: Galerij

source: The diverse collections of KU Leuven Libraries hold many fascinating works, both famous masterpieces and hidden treasures. Dive into our gallery of showcases and their stories.
nl_be: De veelzijdige collecties van KU Leuven Bibliotheken bevatten zowel gekende topstukken als minder bekende, maar minstens even fascinerende werken. Laat je verrassen door het verhaal dat zij vertellen.

source: Discover selected showcases
nl_be: Ontdek bijzondere werken

source: Projects
nl_be: Projecten

source: The digital availability of its collections is a top priority for KU Leuven Libraries. Find out more about our digitisation projects and programmes.
nl_be: Voor KU Leuven Bibliotheken is het digitaal beschikbaar maken van haar collecties een topprioriteit. Maak kennis met onze digitaliseringsprojecten en –programma’s.

source: View the digitisation projects
nl_be: Bekijk de digitaliseringsprojecten

source: Recent exhibitions
nl_be: Recente tentoonstellingen

source: View exhibition
nl_be: Bekijk tentoonstelling

source: Exhibitions
nl_be: Tentoonstellingen

source: Exhibition
nl_be: Tentoonstelling

source: All exhibitions
nl_be: Alle tentoonstellingen

source: Recent selected showcases
nl_be: Recente bijzondere werken

source: View this selected showcase
nl_be: Bekijk dit werk

source: All selected showcases
nl_be: Alle bijzondere werken

source: Recent projects
nl_be: Recente projecten

source: View project
nl_be: Bekijk project

source: All projects
nl_be: Alle projecten

source: View more information
nl_be: Bekijk uitgebreide beschrijving

source: View the complete object
nl_be: Bekijk het volledige object

source: The collection
nl_be: De collectie

source: results
nl_be: resultaten

source: Search the collection
nl_be: Zoek in de collection

source: Filter on:
nl_be: Filter op:

source: exhibit
nl_be: tentoonstelling

source: selected showcase
nl_be: bijzonder werk

source: Exhibits
nl_be: Tentoonstellingen

source: Next page
nl_be: Volgende pagina

source: Previous page
nl_be: Vorige pagina

source: Read more about this item
nl_be: Lees meer over het object
